Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: You also don’t have any information about who saved the snapshots, when they were saved, or why they were saved.
es: Asimismo, careces de información alguna sobre quién guardó las instantáneas de esos momentos, cuándo fueron guardados o por qué se guardaron.

source: The `rack` directory is there, but empty.
es: La carpeta `rack` está presente, pero vacia.

source: They’re local branches that you can’t move; they’re moved automatically whenever you do any network communication.
es: Son ramas locales que no puedes mover; se mueven automáticamente cuando estableces comunicaciones en la red.

source: This is generally straightforward to do.
es: Normalmente suele ser sencillo.

source: Cualquier sistema de control de versiones moderno tiene algún mecanismo para soportar distintas ramas.
es: Cualquier sistema de control de versiones moderno tiene algún mecanismo para soportar distintos ramales.

source: Because Git allows you to have multiple remote repositories, it’s possible to have a workflow where each developer has write access to their own public repository and read access to everyone else’s.
es: Al permitir multiples repositorios remotos, en Git es posible tener un flujo de trabajo donde cada desarrollador tenga acceso de escritura a su propio repositorio público y acceso de lectura a los repositorios de todos los demás.

source: In Git, there are two main ways to integrate changes from one branch into another: the `merge` and the `rebase`.
es: En Git tenemos dos formas de integrar cambios de una rama en otra: la fusión (merge) y la reorganización (rebase).

source: Add the repo.rb file from the Grit library you worked with earlier — this is about a 12K source code file:
es: Añadiendo el archivo repo.rb de la libreria Grit con la que has estado trabajando anteriormente, supondrá añadir un achivo con unos 12 Kbytes de código fuente.

source: That way, they can correct any problems before committing and before those issues become more difficult to fix.
es: De esta forma, pueden corregir los problemas antes de confirmar cambios y antes de que se conviertan en algo realmente complicado de arreglar.

source: If you’ve lost push access by pushing a messed-up configuration, you can manually fix the file on the server under `/home/git/.gitosis.conf` — the file from which Gitosis reads its info.
es: Si, por lo que sea, pierdes acceso de envio (push) de nuevos cambios, (por ejemplo, tras haber enviado una configuración problemática); siempre puedes arreglar manualmente ,en el propio servidor, el archivo '/home/git/.gitosis.conf', (el archivo del que Gitosis lee su configuración).

source: Then, you must tell bisect when the last known good state was, using `git bisect good [good_commit]`:
es: Y después, con el comando `git bisect good [good_commit]`, se le indica cual es la última confirmación de cambios conocida donde el código funcionaba bien:

source: By default, Git passes the following arguments to the diff program:
es: Por defecto, Git pasa los siguientes argumentos al programa diff (comparador):

source: Insert 18333fig0406.png Figure 4-6.
es: Insert 18333fig0406.png Figura 4-6.

source: `git apply` is overall much more paranoid than `patch`.
es: 'git apply' es, de lejos, mucho más paranoico que 'patch'.

source: Your master branch points to the same place as your hotfix branch after the merge.
es: Tras la fusión (merge), la rama 'master' apunta al mismo sitio que la rama 'hotfix'.

source: In this example, you’ll use the `authorized_keys` method for authenticating your users.
es: En este ejemplo, usarás el método de las 'claves autorizadas' para autentificar a tus usuarios.

source: This is very similar to what `receive-pack` responds with, but the capabilities are different.
es: La respuesta es muy similar a la dada por `receive-pack`, pero las capacidades que se indican son diferentes.

source: Jessica doesn’t have push access to the `master` branch — only the integrators do — so she has to push to another branch in order to collaborate with John:
es: Como Jessica no tiene acceso de envio a la rama 'master' --solo los integradores lo tienen--, ha de enviar a alguna otra rama para poder colaborar con John:

source: Instead, Git records it as a particular commit from that repository.
es: En su lugar, Git realiza confirmaciones de cambio particulares en ese repositorio.

source: If you run this instead of setting up the `extMerge` and `extDiff` files, Git will use KDiff3 for merge resolution and the normal Git diff tool for diffs.
es: Si utilizas este comando en lugar de preparar los archivos 'extMerge' y 'extDiff' antes comentados, Git utilizará KDiff3 para resolución de conflictos de integración y la herramienta estandar diff para las comparaciones.

source: Get a writable copy of any repository by clicking the "fork" button.
es: Obtener una copia sobre la que escribir, clicando sobre el botón "fork" de un repositorio.

source: At this point, you may want to turn to a widely used software project called Gitosis.
es: En este punto, es posible que desees cambiar a un popular programa llamado Gitosis.

source: However, you can set up other tracking branches if you wish — ones that don’t track branches on `origin` and don’t track the `master` branch.
es: Sin embargo, puedes preparar otras ramas de seguimiento si deseas tener unas que no hagan seguimiento de ramas en 'origin' y que no sigan a la rama 'master'.

source: Luckily, Git provides a tool to help you send properly formatted patches via IMAP, which may be easier for you.
es: Afortunadamente, Git suministra una herramienta que nos puede ser de gran ayuda para enviar parches correctamente formateados a través de protocolo IMAP, facilitandonos así las cosas.

source: You’ll notice the phrase "Fast forward" in that merge.
es: Merece destacar la frase "Avance rápido" ("Fast forward") que aparece en la respuesta al comando.

source: The first developer, John, clones the repository, makes a change, and commits locally.
es: El primero de ellos, John, clona el repositorio, hace algunos cambios y los confirma localmente:

source: However, that isn’t convenient, so Git provides another shorthand for doing the same thing: the triple-dot syntax.
es: Pero esto no es lo más conveniente. De ahí que Git suministre otro atajo para hacerlo: la sintaxis del triple-punto.

source: If you pass `-C` to `git blame`, Git analyzes the file you’re annotating and tries to figure out where snippets of code within it originally came from if they were copied from elsewhere.
es: Indicando la opción `-C` en el comando `git blame`, Git analizará el archivo que se está anotando para intentar averiguar si alguno de sus fragmentos pudiera provenir de, o haber sido copiado de, algún otro archivo.

source: The downside to this approach is the whining that will inevitably result when your users’ commit pushes are rejected.
es: Lo malo del sistema descrito en la sección anterior pueden ser los lamentos que inevitablemente se van a producir cuando los envios de tus usuarios sean rechazados.

source: The example `pre-rebase` hook that Git installs does this, although it assumes that next is the name of the branch you publish.
es: El script de ejemplo para 'pre-rebase' hace precisamente eso, aunque asumiendo que 'next' es el nombre de la rama publicada.

source: The mode is taken from normal UNIX modes but is much less flexible — these three modes are the only ones that are valid for files (blobs) in Git (although other modes are used for directories and submodules).
es: Estos modos son como los modos de UNIX, pero mucho menos flexibles. Solo estos tres modos son válidos para archivos (blobs) en Git; (aunque también se permiten otros modos para carpetas y submódulos).

source: Remote branches are references to the state of branches on your remote repositories.
es: Las ramas remotas son referencias al estado de ramas en tus repositorios remotos.

source: Jessica thinks her topic branch is ready, but she wants to know what she has to merge her work into so that she can push.
es: Jessica considera su rama puntual terminada, pero quiere saber lo que debe integrar con su trabajo antes de poder enviarla.

source: To modify a commit that is farther back in your history, you must move to more complex tools.
es: Para modificar una confirmación de cambios situada bastante atrás en el historial, es necesario emplear herramientas más complejas.

source: This kind of workflow isn’t common but can be useful in very big projects or in highly hierarchical environments, because as it allows the project leader (the dictator) to delegate much of the work and collect large subsets of code at multiple points before integrating them.
es: Esta manera de trabajar no es muy habitual, pero es muy util en proyectos muy grandes o en organizaciónes fuertemente jerarquizadas. Permite al lider o a la lider del proyecto (el/la dictador/a) delegar gran parte del trabajo; recolectando el fruto de multiples puntos de trabajo antes de integrarlo en el proyecto.

source: For instance, if you want to include a file named `LAST_COMMIT` in your project, and the last commit date was automatically injected into it when `git archive` ran, you can set up the file like this:
es: Por ejemplo, si deseas incluir un archivo llamado 'LAST COMMIT' en tu proyecto, y poner en él automáticamente la fecha de la última confirmación de cambios cada vez que lances el comando 'git archive':

source: You can make Git read and write to this file by passing the `--global` option.
es: Con la opción '--global', 'git config' lee y escribe en este archivo.

source: Occasionally, this process doesn’t go smoothly.
es: En algunas ocasiones, los procesos de fusión no suelen ser fluidos.

source: This basically says, “Check out the client branch, figure out the patches from the common ancestor of the `client` and `server` branches, and then replay them onto `master`.” It’s a bit complex; but the result, shown in Figure 3-32, is pretty cool.
es: Esto viene a decir: "Activa la rama 'client', averigua los cambios desde el ancestro común entre las ramas 'client' y 'server', y aplicalos en la rama 'master'. Puede parecer un poco complicado, pero los resultados, mostrados en la Figura 3-32, son realmente interesantes.

source: Keeping all users’ public keys in the `authorized_keys` file for access works well only for a while.
es: Mantener claves públicas, para todos los usuarios, en el archivo 'authorized_keys', puede ser una buena solución inicial.

source: The `request-pull` command takes the base branch into which you want your topic branch pulled and the Git repository URL you want them to pull from, and outputs a summary of all the changes you’re asking to be pulled in.
es: Este comando 'request-pull' compara la rama base donde deseas que se integre tu rama puntual y el repositorio desde cuya URL deseas que se haga, para darte un resumen de todos los cambios que deseas integrar.

source: Well, doing so creates a new pointer for you to move around.
es: Bueno....., simplemente se crea un nuevo apuntador para que lo puedas mover libremente.

source: Now you can see that the TODO and index.html files are staged and the simplegit.rb file is still unstaged.
es: En estos momentos se ve que los archivos TODO e index.html están en el área de preparación y que el archivo simplegit.rb no está aún.

source: We’ll discuss how to export a bare repository copy for this purpose in the next section, “Getting Git on a Server.”
es: En la próxima sección, "Disponiendo Git en un servidor", veremos cómo exportar un repositorio básico para conseguir esto.

source: However, if your message contains the proper pattern, Git allows you to commit:
es: Sin embargo, si el mensaje está formateado adecuadamente, Git te permitirá confirmar cambios:

source: If you click it, you see a form with information about the import process and a text box where you can paste in the URL of your public Subversion project (see Figure 4-9).
es: Si clicas sobre dicho enlace, verás un formulario con información sobre el proceso de importación y un cuadro de texto donde puedes pegar la URL de tu proyecto Subversion (ver Figura 4-9).

source: If your project is very large, nonstandard, or private, this process probably won’t work for you.
es: Si tu proyecto es muy grande, no-estandar o privado, es muy posible que no se pueda importar.

source: If you don’t specify a stash, Git assumes the most recent stash and tries to apply it:
es: Si no se indica ningún grupo concreto, Git asume que se desea reaplicar el grupo de cambios más reciente de entre los guardados en la pila.

source: One of them is the _subtree_ merge, and you can use it to deal with the subproject issue.
es: Una de ellas, la _fusión_subárbol_ (_subtree_ merge), es precisamente la más adecuada para tratar con subproyectos.

source: The format for a commit object is simple: it specifies the top-level tree for the snapshot of the project at that point; the author/committer information pulled from your `user.name` and `user.email` configuration settings, with the current timestamp; a blank line, and then the commit message.
es: El formato para un objeto de confirmación de cambios (commit) es sencillo, contemplando: el objeto tipo árbol para la situación del proyecto en ese momento puntual; la información sobre el autor/confirmador, recogida desde las opciones de configuración`user.name` y `user.email`; la fecha y hora actuales; una línea en blanco; y el mensaje de la confirmación de cambios.

source: In this environment, you can follow a workflow similar to what you might do when using Subversion or another centralized system.
es: En un entorno como este, puedes seguir un flujo de trabajo similar al que adoptarías usando Subversion o algún otro sistema centralizado.

source: Since `clone` is basically a `git init` then a `git fetch`, we see some output from the `git init` part, which creates an empty directory.
es: Como 'clone' es fundamentalmente un 'git init' seguido de un 'git fetch', veremos algunos de los mensajes de la parte 'init', concretamente de la parte en que se crea una carpeta vacia.

source: If you want to use a merge tool other than the default (Git chose `opendiff` for me in this case because I ran the command on a Mac), you can see all the supported tools listed at the top after “merge tool candidates”.
es: Si deseas usar una herramienta distinta de la escogida por defecto (en mi caso 'opendiff', porque estoy lanzando el comando en un Mac), puedes escogerla entre la lista de herramientas soportadas mostradas al principio ("merge tool candidates").

source: Suppose you’ve done an import from another source control system and have subdirectories that make no sense (trunk, tags, and so on).
es: Por ejemplo, en el caso de que se haya importado trabajo desde otro sistema de control de versiones, y se tengan algunas subcarpetas sin sentido (trunk, tags,...).

source: You’re ready to go — nothing else needed.
es: y.... ¡listo!, eso es todo lo que necesitas.

source: In addition, it sends back the HEAD reference so the client knows what to check out if this is a clone.
es: Además, nos indica la referencia HEAD, para que el cliente pueda saber qué ha de activar (check out) en el caso de estar requiriendo un clon.

source: Now, let’s say you decide you like the second solution to your issue best (`iss91v2`); and you showed the `dumbidea` branch to your coworkers, and it turns out to be genius.
es: En este momento, supongamos que te decides por la segunda solución al problema (rama 'iss92v2'); y que, tras mostrar la rama 'dumbidea' a tus compañeros, resulta que les parece una idea genial.

source: This replays your `server` work on top of your `master` work, as shown in Figure 3-34.
es: Esto vuelca el trabajo de 'server' sobre el de 'master', tal y como se muestra en la Figura 3-34.

source: A history with a topic branch off another topic branch.
es: Un registro con una rama puntual sobre otra rama puntual.

source: One cool trick for which you can use Git attributes is telling Git which files are binary (in cases it otherwise may not be able to figure out) and giving Git special instructions about how to handle those files.
es: Un buen truco donde utilizar los atributos Git es para indicarle cuales de los archivos son binarios, (en los casos en que Git no podría llegar a determinarlo por sí mismo), dandole a Git instruciones especiales sobre cómo tratar estos archivos.

source: Because 'scott' is the only user in the system right now, you’ll add him as the only member, and you’ll create a new project called `iphone_project` to start on:
es: Por ser 'scott' el único usuario que tienes definido por ahora, lo añadirás como el único miembro. Y puedes crear además un proyecto llamado 'iphone_project' para empezar:

source: It gets a list of all the commits you’re about to rewrite and checks whether they exist in any of your remote references.
es: Con la lista de confirmaciones de cambio que estás a punto de reescribir, las comprueba por si alguna de ellas existe en alguna de tus referencias remotas.

source: If you’re running a firewall, you’ll also need to punch a hole in it at port 9418 on the box you’re setting this up on.
es: Si tienes un cortafuegos activo, necesitarás abrir el puerto 9418 para la máquina donde estás configurando el demónio Git.

source: Running your own server gives you a lot of control and allows you to run the server within your own firewall, but such a server generally requires a fair amount of your time to set up and maintain.
es: Disponer de tu propio servidor te da pleno control sobre él y te permite trabajar dentro de tu propio cortafuegos. Pero un servidor así suele requerir bastante de tu tiempo para prepararlo y mantenerlo.

source: So, to get a list of all the commit SHAs introduced between one commit SHA and another, you can run something like this:
es: Con él, puedes obtener la lista de todas las claves SHA que se han introducido entre una clave SHA y otra clave SHA dadas; obtendrás algo así como esto:

source: For example, to clone a local repository, you can run something like this:
es: Por ejemplo, para clonar un repositorio local, puedes usar algo como:

source: This is useful if you want to keep the `experiment` branch up to date and preview what you’re about to merge in.
es: Esto es útil si se desea mantener actualizada la rama 'experiment' y previsualizar lo que se está a punto de fusionar en ella.

source: For really large companies or projects, the number of developers could be in the thousands, with dozens or even hundreds of patches coming in each day.
es: En proyectos o empresas verdaderamente grandes puedes tener cientos de desarrolladores, con docenas o incluso cientos de parches llegando cada día.

source: However, it can be helpful sometimes when you need to see what’s really going on.
es: Pero que, sin embargo, pueden ser muy útiles cuando se desea ver lo que realmente sucede "tras las bambalinas", en el interior de Git.

source: When you create the commit by running `git commit`, Git checksums each subdirectory (in this case, just the root project directory) and stores those tree objects in the Git repository.
es: Cuando creas una confirmación con el comando 'git commit', Git realiza sumas de control de cada subcarpeta (en el ejemplo, solamente tenemos la carpeta principal del proyecto), y guarda en el repositorio Git una copia de cada uno de los archivos contenidos en ella/s.

source: You can add it as a new remote reference to the project you’re currently working on by running the `git remote add` command as we covered in Chapter 2.
es: Puedes incluirlo como una nueva referencia remota a tu proyecto actual, mediante el comando 'git remote add', tal y como vimos en el capítulo 2.

source: Here are all the objects in the example directory now, commented with what they store:
es: Aquí se muestran todos los objetos presentes en este momento en la carpeta del ejemplo, con comentarios acerca de lo que almacena cada uno de ellos:

source: If you check out one and then the other, you can see that they have different project roots:
es: Si se comprueban una o la otra, se puede observar que ambos proyectos tienen distintas raices:

source: git:x:1000:1000::/home/git:/usr/bin/git-shell
es: git:x:1000:1000::/home/git:/usr/bin/git-shellgit:x:1000:1000::/home/git:/usr/bin/git-shell

source: Now you can remove your topic branch and drop the commits you didn’t want to pull in.
es: Ahora, ya puedes borrar la rama puntual y descartar las confirmaciones de cambios que no deseas integrar.

source: Limit log functionality to the first 20
es: Limit log functionality to the first 20Limit log functionality to the first 20Limit log functionality to the first 20

source: Change `/bin/sh` to `/usr/bin/git-shell` (or run `which git-shell` to see where it’s installed).
es: Y cambiar '/bin/sh' por '/usr/bin/git-shell' (nota: puedes utilizar el comando 'which git-shell' para ver dónde está instalado dicho shell).

source: First you need to enable the hook:
es: Lo primero, es activar el anclaje (hook):

source: For pre-1.6 versions of Git, the example files are named properly but are not executable.
es: Para las versiones anteriores a la 1.6, los ejemplos tienen el nombre correcto, pero les falta la marca de ejecutables.

source: Annotating a file helps if you know where the issue is to begin with.
es: La anotación de archivos es útil si se conoce aproximadamente el punto dónde se localizan los problemas.

source: GitHub is by far the largest open source Git hosting site and it’s also one of the very few that offers both public and private hosting options so you can keep your open source and private commercial code in the same place.
es: GitHub es, de lejos, el mayor sitio de alberge público de proyectos Git de código abierto. Y es también uno de los pocos que ofrece asimismo opciones de alberge privado; de tal forma que puedes tener tanto tus proyectos de código abierto y como los de código comercial cerrado en un mismo emplazamiento.

source: If all 6.5 billion humans on Earth were programming, and every second, each one was producing code that was the equivalent of the entire Linux kernel history (1 million Git objects) and pushing it into one enormous Git repository, it would take 5 years until that repository contained enough objects to have a 50% probability of a single SHA-1 object collision.
es: Si todos los 6'5 billones de humanos en el planeta Tierra estuvieran programando y, cada segundo, cada uno de ellos escribiera código equivalente a todo el histórico del kernel de Linux (cerca de 1 millón de objetos Git), enviandolo todo a un enorme repositorio Git. Serían necesarios unos 5 años antes de que dicho repositorio contuviera suficientes objetos como para tener una probabilidad del 50% de darse una sola colisión en el código SHA-1.

source: If someone only has a single patch to contribute once in a while, then accepting it over e-mail may be less time consuming than requiring everyone to run their own server and having to continually add and remove remotes to get a few patches.
es: En cambio, si alguien tiene un solo parche para enviarte, una sola vez, puede ser más efectivo aceptarlo directamente por correo-e; en lugar de pedir a todo el mundo que tenga cada uno su propio servidor y tener nosotros que estar continuamente añadiendo y quitando remotos para cada parche.

source: You now have a nice tarball and a zip archive of your project release that you can upload to your website or e-mail to people.
es: Así, tendrás sendos archivos tarball y zip con tu nueva versión, listos para subirlos a tu sitio web o para ser enviados por correo electrónico a tus usuarios.
